# Pandas Series vs DataFrame

## Pandas Series –

In [1]:

import pandas as pd

# Example 1: Series from list
s1 = pd.Series([10, 20, 30, 40])
s1

0    10
1    20
2    30
3    40
dtype: int64

In [2]:

# Example 2: Series with custom index
s2 = pd.Series([100, 200, 300], index=['a', 'b', 'c'])
s2

a    100
b    200
c    300
dtype: int64

In [3]:

# Example 3: Series from dictionary
s3 = pd.Series({'Math': 85, 'Science': 90, 'English': 88})
s3

Math       85
Science    90
English    88
dtype: int64

In [4]:

# Example 4: Accessing elements
s1[0], s2['b']

(np.int64(10), np.int64(200))

## Pandas DataFrame –

In [5]:

# Example 1: DataFrame from dictionary
df1 = pd.DataFrame({
    'Name': ['Amit', 'Pankaj', 'Ravi'],
    'Age': [21, 22, 20]
})
df1

     Name  Age
0    Amit   21
1  Pankaj   22
2    Ravi   20

In [6]:

# Example 2: DataFrame from list of lists
df2 = pd.DataFrame(
    [[1, 'Python'], [2, 'Java'], [3, 'C++']],
    columns=['ID', 'Language']
)
df2

   ID Language
0   1   Python
1   2     Java
2   3      C++

In [7]:

# Example 3: Accessing columns and rows
df1['Name'], df1.iloc[0]

(0      Amit
 1    Pankaj
 2      Ravi
 Name: Name, dtype: object,
 Name    Amit
 Age       21
 Name: 0, dtype: object)

In [8]:

# Example 4: Adding a new column
df1['Marks'] = [85, 90, 88]
df1

     Name  Age  Marks
0    Amit   21     85
1  Pankaj   22     90
2    Ravi   20     88